In [1]:
import pandas as pd

# txt dosyasını DataFrame'e yükleme
df = pd.read_csv("seaports//seaports.txt", delimiter="\t")

# Latitude ve Longitude sütunlarındaki derece işaretlerini kaldırma ve ondalık sayıya çevirme
df["Latitude"] = df["Latitude"].str.replace("°", "").str.replace("'", "").str.replace('"', "").str.replace("N", "").str.replace("S", "-").astype(float)
df["Longitude"] = df["Longitude"].str.replace("°", "").str.replace("'", "").str.replace('"', "").str.replace("E", "").str.replace("W", "-").astype(float)

# DataFrame'i gösterme
print(df)

   Seaport Name Seaport Code Country  Latitude  Longitude
0        Adalia        TRAYT  Turkey    3652.0     3046.0
1       Ambarli        TRAMB  Turkey    4058.0     2842.0
2       Antalya        TRAYT  Turkey    3652.0     3046.0
3        Bodrum        TRBOD  Turkey    3702.0     2727.0
4        Budrum        TRBOD  Turkey    3702.0     2727.0
..          ...          ...     ...       ...        ...
65         Sudr        EGRSU   Egypt    2935.0     3241.0
66         Suez        EGSUZ   Egypt    2958.0     3232.0
67          Tor        EGTOR   Egypt    2814.0     3336.0
68  Wadi Feiran        EGWAF   Egypt    2844.0     3312.0
69     Zeit Bay        EGZEI   Egypt    2750.0     3336.0

[70 rows x 5 columns]

In [2]:
df["Latitude"] = df["Latitude"]/100 
df["Longitude"] = df["Longitude"]/100

In [3]:
df.head()

  Seaport Name Seaport Code Country  Latitude  Longitude
0       Adalia        TRAYT  Turkey     36.52      30.46
1      Ambarli        TRAMB  Turkey     40.58      28.42
2      Antalya        TRAYT  Turkey     36.52      30.46
3       Bodrum        TRBOD  Turkey     37.02      27.27
4       Budrum        TRBOD  Turkey     37.02      27.27

In [4]:
df = df.drop(['Seaport Code',"Seaport Name"], axis=1)

In [5]:
df.head()

  Country  Latitude  Longitude
0  Turkey     36.52      30.46
1  Turkey     40.58      28.42
2  Turkey     36.52      30.46
3  Turkey     37.02      27.27
4  Turkey     37.02      27.27

In [6]:
df.to_csv("seaports.csv")